[options]
mode prove
depth 30

[engines]
smtbmc yices
# smtbmc boolector
# abc pdr
# aiger avy
# aiger suprove

[script]
read_verilog -formal kitest.v
opt_merge -share_all
prep -top kitest
opt_merge -share_all

[files]
kitest.v
